gitpan/zxid/c/saml2-getput.c
struct zx_ds_RSAKeyValue_s* zx_ds_KeyValue_GET_RSAKeyValue(struct zx_ds_KeyValue_s* x, int n)
{
  struct zx_ds_RSAKeyValue_s* y;
  if (!x) return 0;
  for (y = x->RSAKeyValue; n>=0 && y; --n, y = (struct zx_ds_RSAKeyValue_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zx_ds_KeyValue_POP_RSAKeyValue) */

struct zx_ds_RSAKeyValue_s* zx_ds_KeyValue_POP_RSAKeyValue(struct zx_ds_KeyValue_s* x)
{
  struct zx_ds_RSAKeyValue_s* y;
  if (!x) return 0;
  y = x->RSAKeyValue;
  if (y)
    x->RSAKeyValue = (struct zx_ds_RSAKeyValue_s*)y->gg.g.n;
  return y;
}

/* FUNC(zx_ds_KeyValue_PUSH_RSAKeyValue) */

void zx_ds_KeyValue_PUSH_RSAKeyValue(struct zx_ds_KeyValue_s* x, struct zx_ds_RSAKeyValue_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->RSAKeyValue->gg.g;
  x->RSAKeyValue = z;
}

/* FUNC(zx_ds_KeyValue_REV_RSAKeyValue) */

void zx_ds_KeyValue_REV_RSAKeyValue(struct zx_ds_KeyValue_s* x)
{
  struct zx_ds_RSAKeyValue_s* nxt;
  struct zx_ds_RSAKeyValue_s* y;
  if (!x) return;
  y = x->RSAKeyValue;
  if (!y) return;
  x->RSAKeyValue = 0;
  while (y) {
    nxt = (struct zx_ds_RSAKeyValue_s*)y->gg.g.n;
    y->gg.g.n = &x->RSAKeyValue->gg.g;
    x->RSAKeyValue = y;
    y = nxt;
  }
}

/* FUNC(zx_ds_KeyValue_PUT_RSAKeyValue) */

void zx_ds_KeyValue_PUT_RSAKeyValue(struct zx_ds_KeyValue_s* x, int n, struct zx_ds_RSAKeyValue_s* z)
{
  struct zx_ds_RSAKeyValue_s* y;
  if (!x || !z) return;
  y = x->RSAKeyValue;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->RSAKeyValue = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zx_ds_RSAKeyValue_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zx_ds_KeyValue_ADD_RSAKeyValue) */

void zx_ds_KeyValue_ADD_RSAKeyValue(struct zx_ds_KeyValue_s* x, int n, struct zx_ds_RSAKeyValue_s* z)
{
  struct zx_ds_RSAKeyValue_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->RSAKeyValue->gg.g;
    x->RSAKeyValue = z;
    return;
  case -1:
    y = x->RSAKeyValue;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zx_ds_RSAKeyValue_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->RSAKeyValue; n > 1 && y; --n, y = (struct zx_ds_RSAKeyValue_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zx_ds_KeyValue_DEL_RSAKeyValue) */

void zx_ds_KeyValue_DEL_RSAKeyValue(struct zx_ds_KeyValue_s* x, int n)
{
  struct zx_ds_RSAKeyValue_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->RSAKeyValue = (struct zx_ds_RSAKeyValue_s*)x->RSAKeyValue->gg.g.n;
    return;
  case -1:
    y = (struct zx_ds_RSAKeyValue_s*)x->RSAKeyValue;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zx_ds_RSAKeyValue_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->RSAKeyValue; n > 1 && y->gg.g.n; --n, y = (struct zx_ds_RSAKeyValue_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}








/* FUNC(zx_ds_Manifest_NUM_Reference) */

int zx_ds_Manifest_NUM_Reference(struct zx_ds_Manifest_s* x)
{
  struct zx_ds_Reference_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->Reference; y; ++n, y = (struct zx_ds_Reference_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zx_ds_Manifest_GET_Reference) */

struct zx_ds_Reference_s* zx_ds_Manifest_GET_Reference(struct zx_ds_Manifest_s* x, int n)
{
  struct zx_ds_Reference_s* y;
  if (!x) return 0;
  for (y = x->Reference; n>=0 && y; --n, y = (struct zx_ds_Reference_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zx_ds_Manifest_POP_Reference) */

struct zx_ds_Reference_s* zx_ds_Manifest_POP_Reference(struct zx_ds_Manifest_s* x)
{
  struct zx_ds_Reference_s* y;
  if (!x) return 0;
  y = x->Reference;
  if (y)
    x->Reference = (struct zx_ds_Reference_s*)y->gg.g.n;
  return y;
}

/* FUNC(zx_ds_Manifest_PUSH_Reference) */

void zx_ds_Manifest_PUSH_Reference(struct zx_ds_Manifest_s* x, struct zx_ds_Reference_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->Reference->gg.g;
  x->Reference = z;
}

/* FUNC(zx_ds_Manifest_REV_Reference) */

void zx_ds_Manifest_REV_Reference(struct zx_ds_Manifest_s* x)
{
  struct zx_ds_Reference_s* nxt;
  struct zx_ds_Reference_s* y;
  if (!x) return;
  y = x->Reference;
  if (!y) return;
  x->Reference = 0;
  while (y) {
    nxt = (struct zx_ds_Reference_s*)y->gg.g.n;
    y->gg.g.n = &x->Reference->gg.g;
    x->Reference = y;
    y = nxt;
  }
}

/* FUNC(zx_ds_Manifest_PUT_Reference) */

void zx_ds_Manifest_PUT_Reference(struct zx_ds_Manifest_s* x, int n, struct zx_ds_Reference_s* z)
{
  struct zx_ds_Reference_s* y;
  if (!x || !z) return;
  y = x->Reference;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->Reference = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zx_ds_Reference_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zx_ds_Manifest_ADD_Reference) */

void zx_ds_Manifest_ADD_Reference(struct zx_ds_Manifest_s* x, int n, struct zx_ds_Reference_s* z)
{
  struct zx_ds_Reference_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->Reference->gg.g;
    x->Reference = z;
    return;
  case -1:
    y = x->Reference;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zx_ds_Reference_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->Reference; n > 1 && y; --n, y = (struct zx_ds_Reference_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zx_ds_Manifest_DEL_Reference) */

void zx_ds_Manifest_DEL_Reference(struct zx_ds_Manifest_s* x, int n)
{
  struct zx_ds_Reference_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->Reference = (struct zx_ds_Reference_s*)x->Reference->gg.g.n;
    return;
  case -1:
    y = (struct zx_ds_Reference_s*)x->Reference;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zx_ds_Reference_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->Reference; n > 1 && y->gg.g.n; --n, y = (struct zx_ds_Reference_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}

/* FUNC(zx_ds_Manifest_GET_Id) */
struct zx_str_s* zx_ds_Manifest_GET_Id(struct zx_ds_Manifest_s* x) { return x->Id; }
/* FUNC(zx_ds_Manifest_PUT_Id) */
void zx_ds_Manifest_PUT_Id(struct zx_ds_Manifest_s* x, struct zx_str_s* y) { x->Id = y; }





/* FUNC(zx_ds_Object_GET_Id) */
struct zx_str_s* zx_ds_Object_GET_Id(struct zx_ds_Object_s* x) { return x->Id; }
/* FUNC(zx_ds_Object_PUT_Id) */
void zx_ds_Object_PUT_Id(struct zx_ds_Object_s* x, struct zx_str_s* y) { x->Id = y; }
/* FUNC(zx_ds_Object_GET_MimeType) */
struct zx_str_s* zx_ds_Object_GET_MimeType(struct zx_ds_Object_s* x) { return x->MimeType; }
/* FUNC(zx_ds_Object_PUT_MimeType) */
void zx_ds_Object_PUT_MimeType(struct zx_ds_Object_s* x, struct zx_str_s* y) { x->MimeType = y; }
/* FUNC(zx_ds_Object_GET_Encoding) */
struct zx_str_s* zx_ds_Object_GET_Encoding(struct zx_ds_Object_s* x) { return x->Encoding; }
/* FUNC(zx_ds_Object_PUT_Encoding) */
void zx_ds_Object_PUT_Encoding(struct zx_ds_Object_s* x, struct zx_str_s* y) { x->Encoding = y; }







/* FUNC(zx_ds_PGPData_NUM_PGPKeyID) */

int zx_ds_PGPData_NUM_PGPKeyID(struct zx_ds_PGPData_s* x)
{
  struct zx_elem_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->PGPKeyID; y; ++n, y = (struct zx_elem_s*)y->g.n) ;
  return n;
}

