gitpan/zxid/c/saml2-getput.c
/* FUNC(zx_ds_PGPData_GET_PGPKeyID) */

struct zx_elem_s* zx_ds_PGPData_GET_PGPKeyID(struct zx_ds_PGPData_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  for (y = x->PGPKeyID; n>=0 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
  return y;
}

/* FUNC(zx_ds_PGPData_POP_PGPKeyID) */

struct zx_elem_s* zx_ds_PGPData_POP_PGPKeyID(struct zx_ds_PGPData_s* x)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  y = x->PGPKeyID;
  if (y)
    x->PGPKeyID = (struct zx_elem_s*)y->g.n;
  return y;
}

/* FUNC(zx_ds_PGPData_PUSH_PGPKeyID) */

void zx_ds_PGPData_PUSH_PGPKeyID(struct zx_ds_PGPData_s* x, struct zx_elem_s* z)
{
  if (!x || !z) return;
  z->g.n = &x->PGPKeyID->g;
  x->PGPKeyID = z;
}

/* FUNC(zx_ds_PGPData_REV_PGPKeyID) */

void zx_ds_PGPData_REV_PGPKeyID(struct zx_ds_PGPData_s* x)
{
  struct zx_elem_s* nxt;
  struct zx_elem_s* y;
  if (!x) return;
  y = x->PGPKeyID;
  if (!y) return;
  x->PGPKeyID = 0;
  while (y) {
    nxt = (struct zx_elem_s*)y->g.n;
    y->g.n = &x->PGPKeyID->g;
    x->PGPKeyID = y;
    y = nxt;
  }
}

/* FUNC(zx_ds_PGPData_PUT_PGPKeyID) */

void zx_ds_PGPData_PUT_PGPKeyID(struct zx_ds_PGPData_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  y = x->PGPKeyID;
  if (!y) return;
  switch (n) {
  case 0:
    z->g.n = y->g.n;
    x->PGPKeyID = z;
    return;
  default:
    for (; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
    z->g.n = y->g.n->n;
    y->g.n = &z->g;
  }
}

/* FUNC(zx_ds_PGPData_ADD_PGPKeyID) */

void zx_ds_PGPData_ADD_PGPKeyID(struct zx_ds_PGPData_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->g.n = &x->PGPKeyID->g;
    x->PGPKeyID = z;
    return;
  case -1:
    y = x->PGPKeyID;
    if (!y) goto add_to_start;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->PGPKeyID; n > 1 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y) return;
  }
  z->g.n = y->g.n;
  y->g.n = &z->g;
}

/* FUNC(zx_ds_PGPData_DEL_PGPKeyID) */

void zx_ds_PGPData_DEL_PGPKeyID(struct zx_ds_PGPData_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->PGPKeyID = (struct zx_elem_s*)x->PGPKeyID->g.n;
    return;
  case -1:
    y = (struct zx_elem_s*)x->PGPKeyID;
    if (!y) return;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->PGPKeyID; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
  }
  y->g.n = y->g.n->n;
}



/* FUNC(zx_ds_PGPData_NUM_PGPKeyPacket) */

int zx_ds_PGPData_NUM_PGPKeyPacket(struct zx_ds_PGPData_s* x)
{
  struct zx_elem_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->PGPKeyPacket; y; ++n, y = (struct zx_elem_s*)y->g.n) ;
  return n;
}

/* FUNC(zx_ds_PGPData_GET_PGPKeyPacket) */

struct zx_elem_s* zx_ds_PGPData_GET_PGPKeyPacket(struct zx_ds_PGPData_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  for (y = x->PGPKeyPacket; n>=0 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
  return y;
}

/* FUNC(zx_ds_PGPData_POP_PGPKeyPacket) */

struct zx_elem_s* zx_ds_PGPData_POP_PGPKeyPacket(struct zx_ds_PGPData_s* x)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  y = x->PGPKeyPacket;
  if (y)
    x->PGPKeyPacket = (struct zx_elem_s*)y->g.n;
  return y;
}

/* FUNC(zx_ds_PGPData_PUSH_PGPKeyPacket) */

void zx_ds_PGPData_PUSH_PGPKeyPacket(struct zx_ds_PGPData_s* x, struct zx_elem_s* z)
{
  if (!x || !z) return;
  z->g.n = &x->PGPKeyPacket->g;
  x->PGPKeyPacket = z;
}

/* FUNC(zx_ds_PGPData_REV_PGPKeyPacket) */

void zx_ds_PGPData_REV_PGPKeyPacket(struct zx_ds_PGPData_s* x)
{
  struct zx_elem_s* nxt;
  struct zx_elem_s* y;
  if (!x) return;
  y = x->PGPKeyPacket;
  if (!y) return;
  x->PGPKeyPacket = 0;
  while (y) {
    nxt = (struct zx_elem_s*)y->g.n;
    y->g.n = &x->PGPKeyPacket->g;
    x->PGPKeyPacket = y;
    y = nxt;
  }
}

/* FUNC(zx_ds_PGPData_PUT_PGPKeyPacket) */

void zx_ds_PGPData_PUT_PGPKeyPacket(struct zx_ds_PGPData_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  y = x->PGPKeyPacket;
  if (!y) return;
  switch (n) {
  case 0:
    z->g.n = y->g.n;
    x->PGPKeyPacket = z;
    return;
  default:
    for (; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
    z->g.n = y->g.n->n;
    y->g.n = &z->g;
  }
}

/* FUNC(zx_ds_PGPData_ADD_PGPKeyPacket) */

void zx_ds_PGPData_ADD_PGPKeyPacket(struct zx_ds_PGPData_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->g.n = &x->PGPKeyPacket->g;
    x->PGPKeyPacket = z;
    return;
  case -1:
    y = x->PGPKeyPacket;
    if (!y) goto add_to_start;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->PGPKeyPacket; n > 1 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y) return;
  }
  z->g.n = y->g.n;
  y->g.n = &z->g;
}

/* FUNC(zx_ds_PGPData_DEL_PGPKeyPacket) */

void zx_ds_PGPData_DEL_PGPKeyPacket(struct zx_ds_PGPData_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->PGPKeyPacket = (struct zx_elem_s*)x->PGPKeyPacket->g.n;
    return;
  case -1:
    y = (struct zx_elem_s*)x->PGPKeyPacket;
    if (!y) return;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->PGPKeyPacket; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
  }
  y->g.n = y->g.n->n;
}








/* FUNC(zx_ds_RSAKeyValue_NUM_Modulus) */

int zx_ds_RSAKeyValue_NUM_Modulus(struct zx_ds_RSAKeyValue_s* x)
{
  struct zx_elem_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->Modulus; y; ++n, y = (struct zx_elem_s*)y->g.n) ;
  return n;
}

/* FUNC(zx_ds_RSAKeyValue_GET_Modulus) */

struct zx_elem_s* zx_ds_RSAKeyValue_GET_Modulus(struct zx_ds_RSAKeyValue_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  for (y = x->Modulus; n>=0 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
  return y;
}

