gitpan/zxid/c/saml2-getput.c
/* FUNC(zx_ds_RSAKeyValue_POP_Modulus) */

struct zx_elem_s* zx_ds_RSAKeyValue_POP_Modulus(struct zx_ds_RSAKeyValue_s* x)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  y = x->Modulus;
  if (y)
    x->Modulus = (struct zx_elem_s*)y->g.n;
  return y;
}

/* FUNC(zx_ds_RSAKeyValue_PUSH_Modulus) */

void zx_ds_RSAKeyValue_PUSH_Modulus(struct zx_ds_RSAKeyValue_s* x, struct zx_elem_s* z)
{
  if (!x || !z) return;
  z->g.n = &x->Modulus->g;
  x->Modulus = z;
}

/* FUNC(zx_ds_RSAKeyValue_REV_Modulus) */

void zx_ds_RSAKeyValue_REV_Modulus(struct zx_ds_RSAKeyValue_s* x)
{
  struct zx_elem_s* nxt;
  struct zx_elem_s* y;
  if (!x) return;
  y = x->Modulus;
  if (!y) return;
  x->Modulus = 0;
  while (y) {
    nxt = (struct zx_elem_s*)y->g.n;
    y->g.n = &x->Modulus->g;
    x->Modulus = y;
    y = nxt;
  }
}

/* FUNC(zx_ds_RSAKeyValue_PUT_Modulus) */

void zx_ds_RSAKeyValue_PUT_Modulus(struct zx_ds_RSAKeyValue_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  y = x->Modulus;
  if (!y) return;
  switch (n) {
  case 0:
    z->g.n = y->g.n;
    x->Modulus = z;
    return;
  default:
    for (; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
    z->g.n = y->g.n->n;
    y->g.n = &z->g;
  }
}

/* FUNC(zx_ds_RSAKeyValue_ADD_Modulus) */

void zx_ds_RSAKeyValue_ADD_Modulus(struct zx_ds_RSAKeyValue_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->g.n = &x->Modulus->g;
    x->Modulus = z;
    return;
  case -1:
    y = x->Modulus;
    if (!y) goto add_to_start;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->Modulus; n > 1 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y) return;
  }
  z->g.n = y->g.n;
  y->g.n = &z->g;
}

/* FUNC(zx_ds_RSAKeyValue_DEL_Modulus) */

void zx_ds_RSAKeyValue_DEL_Modulus(struct zx_ds_RSAKeyValue_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->Modulus = (struct zx_elem_s*)x->Modulus->g.n;
    return;
  case -1:
    y = (struct zx_elem_s*)x->Modulus;
    if (!y) return;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->Modulus; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
  }
  y->g.n = y->g.n->n;
}



/* FUNC(zx_ds_RSAKeyValue_NUM_Exponent) */

int zx_ds_RSAKeyValue_NUM_Exponent(struct zx_ds_RSAKeyValue_s* x)
{
  struct zx_elem_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->Exponent; y; ++n, y = (struct zx_elem_s*)y->g.n) ;
  return n;
}

/* FUNC(zx_ds_RSAKeyValue_GET_Exponent) */

struct zx_elem_s* zx_ds_RSAKeyValue_GET_Exponent(struct zx_ds_RSAKeyValue_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  for (y = x->Exponent; n>=0 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
  return y;
}

/* FUNC(zx_ds_RSAKeyValue_POP_Exponent) */

struct zx_elem_s* zx_ds_RSAKeyValue_POP_Exponent(struct zx_ds_RSAKeyValue_s* x)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  y = x->Exponent;
  if (y)
    x->Exponent = (struct zx_elem_s*)y->g.n;
  return y;
}

/* FUNC(zx_ds_RSAKeyValue_PUSH_Exponent) */

void zx_ds_RSAKeyValue_PUSH_Exponent(struct zx_ds_RSAKeyValue_s* x, struct zx_elem_s* z)
{
  if (!x || !z) return;
  z->g.n = &x->Exponent->g;
  x->Exponent = z;
}

/* FUNC(zx_ds_RSAKeyValue_REV_Exponent) */

void zx_ds_RSAKeyValue_REV_Exponent(struct zx_ds_RSAKeyValue_s* x)
{
  struct zx_elem_s* nxt;
  struct zx_elem_s* y;
  if (!x) return;
  y = x->Exponent;
  if (!y) return;
  x->Exponent = 0;
  while (y) {
    nxt = (struct zx_elem_s*)y->g.n;
    y->g.n = &x->Exponent->g;
    x->Exponent = y;
    y = nxt;
  }
}

/* FUNC(zx_ds_RSAKeyValue_PUT_Exponent) */

void zx_ds_RSAKeyValue_PUT_Exponent(struct zx_ds_RSAKeyValue_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  y = x->Exponent;
  if (!y) return;
  switch (n) {
  case 0:
    z->g.n = y->g.n;
    x->Exponent = z;
    return;
  default:
    for (; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
    z->g.n = y->g.n->n;
    y->g.n = &z->g;
  }
}

/* FUNC(zx_ds_RSAKeyValue_ADD_Exponent) */

void zx_ds_RSAKeyValue_ADD_Exponent(struct zx_ds_RSAKeyValue_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->g.n = &x->Exponent->g;
    x->Exponent = z;
    return;
  case -1:
    y = x->Exponent;
    if (!y) goto add_to_start;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->Exponent; n > 1 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y) return;
  }
  z->g.n = y->g.n;
  y->g.n = &z->g;
}

/* FUNC(zx_ds_RSAKeyValue_DEL_Exponent) */

void zx_ds_RSAKeyValue_DEL_Exponent(struct zx_ds_RSAKeyValue_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->Exponent = (struct zx_elem_s*)x->Exponent->g.n;
    return;
  case -1:
    y = (struct zx_elem_s*)x->Exponent;
    if (!y) return;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->Exponent; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
  }
  y->g.n = y->g.n->n;
}








/* FUNC(zx_ds_Reference_NUM_Transforms) */

int zx_ds_Reference_NUM_Transforms(struct zx_ds_Reference_s* x)
{
  struct zx_ds_Transforms_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->Transforms; y; ++n, y = (struct zx_ds_Transforms_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zx_ds_Reference_GET_Transforms) */

struct zx_ds_Transforms_s* zx_ds_Reference_GET_Transforms(struct zx_ds_Reference_s* x, int n)
{
  struct zx_ds_Transforms_s* y;
  if (!x) return 0;
  for (y = x->Transforms; n>=0 && y; --n, y = (struct zx_ds_Transforms_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zx_ds_Reference_POP_Transforms) */

struct zx_ds_Transforms_s* zx_ds_Reference_POP_Transforms(struct zx_ds_Reference_s* x)
{
  struct zx_ds_Transforms_s* y;
  if (!x) return 0;
  y = x->Transforms;
  if (y)
    x->Transforms = (struct zx_ds_Transforms_s*)y->gg.g.n;
  return y;
}

/* FUNC(zx_ds_Reference_PUSH_Transforms) */

