gitpan/zxid/c/saml2-getput.c
void zx_sa_Assertion_REV_AuthnStatement(struct zx_sa_Assertion_s* x)
{
  struct zx_sa_AuthnStatement_s* nxt;
  struct zx_sa_AuthnStatement_s* y;
  if (!x) return;
  y = x->AuthnStatement;
  if (!y) return;
  x->AuthnStatement = 0;
  while (y) {
    nxt = (struct zx_sa_AuthnStatement_s*)y->gg.g.n;
    y->gg.g.n = &x->AuthnStatement->gg.g;
    x->AuthnStatement = y;
    y = nxt;
  }
}

/* FUNC(zx_sa_Assertion_PUT_AuthnStatement) */

void zx_sa_Assertion_PUT_AuthnStatement(struct zx_sa_Assertion_s* x, int n, struct zx_sa_AuthnStatement_s* z)
{
  struct zx_sa_AuthnStatement_s* y;
  if (!x || !z) return;
  y = x->AuthnStatement;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->AuthnStatement = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zx_sa_AuthnStatement_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zx_sa_Assertion_ADD_AuthnStatement) */

void zx_sa_Assertion_ADD_AuthnStatement(struct zx_sa_Assertion_s* x, int n, struct zx_sa_AuthnStatement_s* z)
{
  struct zx_sa_AuthnStatement_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->AuthnStatement->gg.g;
    x->AuthnStatement = z;
    return;
  case -1:
    y = x->AuthnStatement;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zx_sa_AuthnStatement_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->AuthnStatement; n > 1 && y; --n, y = (struct zx_sa_AuthnStatement_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zx_sa_Assertion_DEL_AuthnStatement) */

void zx_sa_Assertion_DEL_AuthnStatement(struct zx_sa_Assertion_s* x, int n)
{
  struct zx_sa_AuthnStatement_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->AuthnStatement = (struct zx_sa_AuthnStatement_s*)x->AuthnStatement->gg.g.n;
    return;
  case -1:
    y = (struct zx_sa_AuthnStatement_s*)x->AuthnStatement;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zx_sa_AuthnStatement_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->AuthnStatement; n > 1 && y->gg.g.n; --n, y = (struct zx_sa_AuthnStatement_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zx_sa_Assertion_NUM_AuthzDecisionStatement) */

int zx_sa_Assertion_NUM_AuthzDecisionStatement(struct zx_sa_Assertion_s* x)
{
  struct zx_sa_AuthzDecisionStatement_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->AuthzDecisionStatement; y; ++n, y = (struct zx_sa_AuthzDecisionStatement_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zx_sa_Assertion_GET_AuthzDecisionStatement) */

struct zx_sa_AuthzDecisionStatement_s* zx_sa_Assertion_GET_AuthzDecisionStatement(struct zx_sa_Assertion_s* x, int n)
{
  struct zx_sa_AuthzDecisionStatement_s* y;
  if (!x) return 0;
  for (y = x->AuthzDecisionStatement; n>=0 && y; --n, y = (struct zx_sa_AuthzDecisionStatement_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zx_sa_Assertion_POP_AuthzDecisionStatement) */

struct zx_sa_AuthzDecisionStatement_s* zx_sa_Assertion_POP_AuthzDecisionStatement(struct zx_sa_Assertion_s* x)
{
  struct zx_sa_AuthzDecisionStatement_s* y;
  if (!x) return 0;
  y = x->AuthzDecisionStatement;
  if (y)
    x->AuthzDecisionStatement = (struct zx_sa_AuthzDecisionStatement_s*)y->gg.g.n;
  return y;
}

/* FUNC(zx_sa_Assertion_PUSH_AuthzDecisionStatement) */

void zx_sa_Assertion_PUSH_AuthzDecisionStatement(struct zx_sa_Assertion_s* x, struct zx_sa_AuthzDecisionStatement_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->AuthzDecisionStatement->gg.g;
  x->AuthzDecisionStatement = z;
}

/* FUNC(zx_sa_Assertion_REV_AuthzDecisionStatement) */

void zx_sa_Assertion_REV_AuthzDecisionStatement(struct zx_sa_Assertion_s* x)
{
  struct zx_sa_AuthzDecisionStatement_s* nxt;
  struct zx_sa_AuthzDecisionStatement_s* y;
  if (!x) return;
  y = x->AuthzDecisionStatement;
  if (!y) return;
  x->AuthzDecisionStatement = 0;
  while (y) {
    nxt = (struct zx_sa_AuthzDecisionStatement_s*)y->gg.g.n;
    y->gg.g.n = &x->AuthzDecisionStatement->gg.g;
    x->AuthzDecisionStatement = y;
    y = nxt;
  }
}

/* FUNC(zx_sa_Assertion_PUT_AuthzDecisionStatement) */

void zx_sa_Assertion_PUT_AuthzDecisionStatement(struct zx_sa_Assertion_s* x, int n, struct zx_sa_AuthzDecisionStatement_s* z)
{
  struct zx_sa_AuthzDecisionStatement_s* y;
  if (!x || !z) return;
  y = x->AuthzDecisionStatement;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->AuthzDecisionStatement = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zx_sa_AuthzDecisionStatement_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zx_sa_Assertion_ADD_AuthzDecisionStatement) */

void zx_sa_Assertion_ADD_AuthzDecisionStatement(struct zx_sa_Assertion_s* x, int n, struct zx_sa_AuthzDecisionStatement_s* z)
{
  struct zx_sa_AuthzDecisionStatement_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->AuthzDecisionStatement->gg.g;
    x->AuthzDecisionStatement = z;
    return;
  case -1:
    y = x->AuthzDecisionStatement;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zx_sa_AuthzDecisionStatement_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->AuthzDecisionStatement; n > 1 && y; --n, y = (struct zx_sa_AuthzDecisionStatement_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zx_sa_Assertion_DEL_AuthzDecisionStatement) */

void zx_sa_Assertion_DEL_AuthzDecisionStatement(struct zx_sa_Assertion_s* x, int n)
{
  struct zx_sa_AuthzDecisionStatement_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->AuthzDecisionStatement = (struct zx_sa_AuthzDecisionStatement_s*)x->AuthzDecisionStatement->gg.g.n;
    return;
  case -1:
    y = (struct zx_sa_AuthzDecisionStatement_s*)x->AuthzDecisionStatement;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zx_sa_AuthzDecisionStatement_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->AuthzDecisionStatement; n > 1 && y->gg.g.n; --n, y = (struct zx_sa_AuthzDecisionStatement_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zx_sa_Assertion_NUM_AttributeStatement) */

