gitpan/zxid/c/saml2-getput.c
int zx_sa_Assertion_NUM_AttributeStatement(struct zx_sa_Assertion_s* x)
{
  struct zx_sa_AttributeStatement_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->AttributeStatement; y; ++n, y = (struct zx_sa_AttributeStatement_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zx_sa_Assertion_GET_AttributeStatement) */

struct zx_sa_AttributeStatement_s* zx_sa_Assertion_GET_AttributeStatement(struct zx_sa_Assertion_s* x, int n)
{
  struct zx_sa_AttributeStatement_s* y;
  if (!x) return 0;
  for (y = x->AttributeStatement; n>=0 && y; --n, y = (struct zx_sa_AttributeStatement_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zx_sa_Assertion_POP_AttributeStatement) */

struct zx_sa_AttributeStatement_s* zx_sa_Assertion_POP_AttributeStatement(struct zx_sa_Assertion_s* x)
{
  struct zx_sa_AttributeStatement_s* y;
  if (!x) return 0;
  y = x->AttributeStatement;
  if (y)
    x->AttributeStatement = (struct zx_sa_AttributeStatement_s*)y->gg.g.n;
  return y;
}

/* FUNC(zx_sa_Assertion_PUSH_AttributeStatement) */

void zx_sa_Assertion_PUSH_AttributeStatement(struct zx_sa_Assertion_s* x, struct zx_sa_AttributeStatement_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->AttributeStatement->gg.g;
  x->AttributeStatement = z;
}

/* FUNC(zx_sa_Assertion_REV_AttributeStatement) */

void zx_sa_Assertion_REV_AttributeStatement(struct zx_sa_Assertion_s* x)
{
  struct zx_sa_AttributeStatement_s* nxt;
  struct zx_sa_AttributeStatement_s* y;
  if (!x) return;
  y = x->AttributeStatement;
  if (!y) return;
  x->AttributeStatement = 0;
  while (y) {
    nxt = (struct zx_sa_AttributeStatement_s*)y->gg.g.n;
    y->gg.g.n = &x->AttributeStatement->gg.g;
    x->AttributeStatement = y;
    y = nxt;
  }
}

/* FUNC(zx_sa_Assertion_PUT_AttributeStatement) */

void zx_sa_Assertion_PUT_AttributeStatement(struct zx_sa_Assertion_s* x, int n, struct zx_sa_AttributeStatement_s* z)
{
  struct zx_sa_AttributeStatement_s* y;
  if (!x || !z) return;
  y = x->AttributeStatement;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->AttributeStatement = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zx_sa_AttributeStatement_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zx_sa_Assertion_ADD_AttributeStatement) */

void zx_sa_Assertion_ADD_AttributeStatement(struct zx_sa_Assertion_s* x, int n, struct zx_sa_AttributeStatement_s* z)
{
  struct zx_sa_AttributeStatement_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->AttributeStatement->gg.g;
    x->AttributeStatement = z;
    return;
  case -1:
    y = x->AttributeStatement;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zx_sa_AttributeStatement_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->AttributeStatement; n > 1 && y; --n, y = (struct zx_sa_AttributeStatement_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zx_sa_Assertion_DEL_AttributeStatement) */

void zx_sa_Assertion_DEL_AttributeStatement(struct zx_sa_Assertion_s* x, int n)
{
  struct zx_sa_AttributeStatement_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->AttributeStatement = (struct zx_sa_AttributeStatement_s*)x->AttributeStatement->gg.g.n;
    return;
  case -1:
    y = (struct zx_sa_AttributeStatement_s*)x->AttributeStatement;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zx_sa_AttributeStatement_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->AttributeStatement; n > 1 && y->gg.g.n; --n, y = (struct zx_sa_AttributeStatement_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}

/* FUNC(zx_sa_Assertion_GET_Version) */
struct zx_str_s* zx_sa_Assertion_GET_Version(struct zx_sa_Assertion_s* x) { return x->Version; }
/* FUNC(zx_sa_Assertion_PUT_Version) */
void zx_sa_Assertion_PUT_Version(struct zx_sa_Assertion_s* x, struct zx_str_s* y) { x->Version = y; }
/* FUNC(zx_sa_Assertion_GET_ID) */
struct zx_str_s* zx_sa_Assertion_GET_ID(struct zx_sa_Assertion_s* x) { return x->ID; }
/* FUNC(zx_sa_Assertion_PUT_ID) */
void zx_sa_Assertion_PUT_ID(struct zx_sa_Assertion_s* x, struct zx_str_s* y) { x->ID = y; }
/* FUNC(zx_sa_Assertion_GET_IssueInstant) */
struct zx_str_s* zx_sa_Assertion_GET_IssueInstant(struct zx_sa_Assertion_s* x) { return x->IssueInstant; }
/* FUNC(zx_sa_Assertion_PUT_IssueInstant) */
void zx_sa_Assertion_PUT_IssueInstant(struct zx_sa_Assertion_s* x, struct zx_str_s* y) { x->IssueInstant = y; }







/* FUNC(zx_sa_Attribute_NUM_AttributeValue) */

int zx_sa_Attribute_NUM_AttributeValue(struct zx_sa_Attribute_s* x)
{
  struct zx_elem_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->AttributeValue; y; ++n, y = (struct zx_elem_s*)y->g.n) ;
  return n;
}

/* FUNC(zx_sa_Attribute_GET_AttributeValue) */

struct zx_elem_s* zx_sa_Attribute_GET_AttributeValue(struct zx_sa_Attribute_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  for (y = x->AttributeValue; n>=0 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
  return y;
}

/* FUNC(zx_sa_Attribute_POP_AttributeValue) */

struct zx_elem_s* zx_sa_Attribute_POP_AttributeValue(struct zx_sa_Attribute_s* x)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  y = x->AttributeValue;
  if (y)
    x->AttributeValue = (struct zx_elem_s*)y->g.n;
  return y;
}

/* FUNC(zx_sa_Attribute_PUSH_AttributeValue) */

void zx_sa_Attribute_PUSH_AttributeValue(struct zx_sa_Attribute_s* x, struct zx_elem_s* z)
{
  if (!x || !z) return;
  z->g.n = &x->AttributeValue->g;
  x->AttributeValue = z;
}

/* FUNC(zx_sa_Attribute_REV_AttributeValue) */

void zx_sa_Attribute_REV_AttributeValue(struct zx_sa_Attribute_s* x)
{
  struct zx_elem_s* nxt;
  struct zx_elem_s* y;
  if (!x) return;
  y = x->AttributeValue;
  if (!y) return;
  x->AttributeValue = 0;
  while (y) {
    nxt = (struct zx_elem_s*)y->g.n;
    y->g.n = &x->AttributeValue->g;
    x->AttributeValue = y;
    y = nxt;
  }
}

/* FUNC(zx_sa_Attribute_PUT_AttributeValue) */

void zx_sa_Attribute_PUT_AttributeValue(struct zx_sa_Attribute_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  y = x->AttributeValue;
  if (!y) return;
  switch (n) {
  case 0:
    z->g.n = y->g.n;
    x->AttributeValue = z;
    return;
  default:
    for (; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
    z->g.n = y->g.n->n;
    y->g.n = &z->g;
  }
}

/* FUNC(zx_sa_Attribute_ADD_AttributeValue) */

