gitpan/zxid/c/saml2-getput.c
int zx_sa_Conditions_NUM_Condition(struct zx_sa_Conditions_s* x)
{
  struct zx_elem_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->Condition; y; ++n, y = (struct zx_elem_s*)y->g.n) ;
  return n;
}

/* FUNC(zx_sa_Conditions_GET_Condition) */

struct zx_elem_s* zx_sa_Conditions_GET_Condition(struct zx_sa_Conditions_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  for (y = x->Condition; n>=0 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
  return y;
}

/* FUNC(zx_sa_Conditions_POP_Condition) */

struct zx_elem_s* zx_sa_Conditions_POP_Condition(struct zx_sa_Conditions_s* x)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  y = x->Condition;
  if (y)
    x->Condition = (struct zx_elem_s*)y->g.n;
  return y;
}

/* FUNC(zx_sa_Conditions_PUSH_Condition) */

void zx_sa_Conditions_PUSH_Condition(struct zx_sa_Conditions_s* x, struct zx_elem_s* z)
{
  if (!x || !z) return;
  z->g.n = &x->Condition->g;
  x->Condition = z;
}

/* FUNC(zx_sa_Conditions_REV_Condition) */

void zx_sa_Conditions_REV_Condition(struct zx_sa_Conditions_s* x)
{
  struct zx_elem_s* nxt;
  struct zx_elem_s* y;
  if (!x) return;
  y = x->Condition;
  if (!y) return;
  x->Condition = 0;
  while (y) {
    nxt = (struct zx_elem_s*)y->g.n;
    y->g.n = &x->Condition->g;
    x->Condition = y;
    y = nxt;
  }
}

/* FUNC(zx_sa_Conditions_PUT_Condition) */

void zx_sa_Conditions_PUT_Condition(struct zx_sa_Conditions_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  y = x->Condition;
  if (!y) return;
  switch (n) {
  case 0:
    z->g.n = y->g.n;
    x->Condition = z;
    return;
  default:
    for (; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
    z->g.n = y->g.n->n;
    y->g.n = &z->g;
  }
}

/* FUNC(zx_sa_Conditions_ADD_Condition) */

void zx_sa_Conditions_ADD_Condition(struct zx_sa_Conditions_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->g.n = &x->Condition->g;
    x->Condition = z;
    return;
  case -1:
    y = x->Condition;
    if (!y) goto add_to_start;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->Condition; n > 1 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y) return;
  }
  z->g.n = y->g.n;
  y->g.n = &z->g;
}

/* FUNC(zx_sa_Conditions_DEL_Condition) */

void zx_sa_Conditions_DEL_Condition(struct zx_sa_Conditions_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->Condition = (struct zx_elem_s*)x->Condition->g.n;
    return;
  case -1:
    y = (struct zx_elem_s*)x->Condition;
    if (!y) return;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->Condition; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
  }
  y->g.n = y->g.n->n;
}



/* FUNC(zx_sa_Conditions_NUM_AudienceRestriction) */

int zx_sa_Conditions_NUM_AudienceRestriction(struct zx_sa_Conditions_s* x)
{
  struct zx_sa_AudienceRestriction_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->AudienceRestriction; y; ++n, y = (struct zx_sa_AudienceRestriction_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zx_sa_Conditions_GET_AudienceRestriction) */

struct zx_sa_AudienceRestriction_s* zx_sa_Conditions_GET_AudienceRestriction(struct zx_sa_Conditions_s* x, int n)
{
  struct zx_sa_AudienceRestriction_s* y;
  if (!x) return 0;
  for (y = x->AudienceRestriction; n>=0 && y; --n, y = (struct zx_sa_AudienceRestriction_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zx_sa_Conditions_POP_AudienceRestriction) */

struct zx_sa_AudienceRestriction_s* zx_sa_Conditions_POP_AudienceRestriction(struct zx_sa_Conditions_s* x)
{
  struct zx_sa_AudienceRestriction_s* y;
  if (!x) return 0;
  y = x->AudienceRestriction;
  if (y)
    x->AudienceRestriction = (struct zx_sa_AudienceRestriction_s*)y->gg.g.n;
  return y;
}

/* FUNC(zx_sa_Conditions_PUSH_AudienceRestriction) */

void zx_sa_Conditions_PUSH_AudienceRestriction(struct zx_sa_Conditions_s* x, struct zx_sa_AudienceRestriction_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->AudienceRestriction->gg.g;
  x->AudienceRestriction = z;
}

/* FUNC(zx_sa_Conditions_REV_AudienceRestriction) */

void zx_sa_Conditions_REV_AudienceRestriction(struct zx_sa_Conditions_s* x)
{
  struct zx_sa_AudienceRestriction_s* nxt;
  struct zx_sa_AudienceRestriction_s* y;
  if (!x) return;
  y = x->AudienceRestriction;
  if (!y) return;
  x->AudienceRestriction = 0;
  while (y) {
    nxt = (struct zx_sa_AudienceRestriction_s*)y->gg.g.n;
    y->gg.g.n = &x->AudienceRestriction->gg.g;
    x->AudienceRestriction = y;
    y = nxt;
  }
}

/* FUNC(zx_sa_Conditions_PUT_AudienceRestriction) */

void zx_sa_Conditions_PUT_AudienceRestriction(struct zx_sa_Conditions_s* x, int n, struct zx_sa_AudienceRestriction_s* z)
{
  struct zx_sa_AudienceRestriction_s* y;
  if (!x || !z) return;
  y = x->AudienceRestriction;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->AudienceRestriction = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zx_sa_AudienceRestriction_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zx_sa_Conditions_ADD_AudienceRestriction) */

void zx_sa_Conditions_ADD_AudienceRestriction(struct zx_sa_Conditions_s* x, int n, struct zx_sa_AudienceRestriction_s* z)
{
  struct zx_sa_AudienceRestriction_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->AudienceRestriction->gg.g;
    x->AudienceRestriction = z;
    return;
  case -1:
    y = x->AudienceRestriction;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zx_sa_AudienceRestriction_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->AudienceRestriction; n > 1 && y; --n, y = (struct zx_sa_AudienceRestriction_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zx_sa_Conditions_DEL_AudienceRestriction) */

