gitpan/zxid/c/saml2-getput.c
void zx_sa_Conditions_DEL_AudienceRestriction(struct zx_sa_Conditions_s* x, int n)
{
  struct zx_sa_AudienceRestriction_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->AudienceRestriction = (struct zx_sa_AudienceRestriction_s*)x->AudienceRestriction->gg.g.n;
    return;
  case -1:
    y = (struct zx_sa_AudienceRestriction_s*)x->AudienceRestriction;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zx_sa_AudienceRestriction_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->AudienceRestriction; n > 1 && y->gg.g.n; --n, y = (struct zx_sa_AudienceRestriction_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zx_sa_Conditions_NUM_OneTimeUse) */

int zx_sa_Conditions_NUM_OneTimeUse(struct zx_sa_Conditions_s* x)
{
  struct zx_sa_OneTimeUse_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->OneTimeUse; y; ++n, y = (struct zx_sa_OneTimeUse_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zx_sa_Conditions_GET_OneTimeUse) */

struct zx_sa_OneTimeUse_s* zx_sa_Conditions_GET_OneTimeUse(struct zx_sa_Conditions_s* x, int n)
{
  struct zx_sa_OneTimeUse_s* y;
  if (!x) return 0;
  for (y = x->OneTimeUse; n>=0 && y; --n, y = (struct zx_sa_OneTimeUse_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zx_sa_Conditions_POP_OneTimeUse) */

struct zx_sa_OneTimeUse_s* zx_sa_Conditions_POP_OneTimeUse(struct zx_sa_Conditions_s* x)
{
  struct zx_sa_OneTimeUse_s* y;
  if (!x) return 0;
  y = x->OneTimeUse;
  if (y)
    x->OneTimeUse = (struct zx_sa_OneTimeUse_s*)y->gg.g.n;
  return y;
}

/* FUNC(zx_sa_Conditions_PUSH_OneTimeUse) */

void zx_sa_Conditions_PUSH_OneTimeUse(struct zx_sa_Conditions_s* x, struct zx_sa_OneTimeUse_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->OneTimeUse->gg.g;
  x->OneTimeUse = z;
}

/* FUNC(zx_sa_Conditions_REV_OneTimeUse) */

void zx_sa_Conditions_REV_OneTimeUse(struct zx_sa_Conditions_s* x)
{
  struct zx_sa_OneTimeUse_s* nxt;
  struct zx_sa_OneTimeUse_s* y;
  if (!x) return;
  y = x->OneTimeUse;
  if (!y) return;
  x->OneTimeUse = 0;
  while (y) {
    nxt = (struct zx_sa_OneTimeUse_s*)y->gg.g.n;
    y->gg.g.n = &x->OneTimeUse->gg.g;
    x->OneTimeUse = y;
    y = nxt;
  }
}

/* FUNC(zx_sa_Conditions_PUT_OneTimeUse) */

void zx_sa_Conditions_PUT_OneTimeUse(struct zx_sa_Conditions_s* x, int n, struct zx_sa_OneTimeUse_s* z)
{
  struct zx_sa_OneTimeUse_s* y;
  if (!x || !z) return;
  y = x->OneTimeUse;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->OneTimeUse = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zx_sa_OneTimeUse_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zx_sa_Conditions_ADD_OneTimeUse) */

void zx_sa_Conditions_ADD_OneTimeUse(struct zx_sa_Conditions_s* x, int n, struct zx_sa_OneTimeUse_s* z)
{
  struct zx_sa_OneTimeUse_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->OneTimeUse->gg.g;
    x->OneTimeUse = z;
    return;
  case -1:
    y = x->OneTimeUse;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zx_sa_OneTimeUse_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->OneTimeUse; n > 1 && y; --n, y = (struct zx_sa_OneTimeUse_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zx_sa_Conditions_DEL_OneTimeUse) */

void zx_sa_Conditions_DEL_OneTimeUse(struct zx_sa_Conditions_s* x, int n)
{
  struct zx_sa_OneTimeUse_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->OneTimeUse = (struct zx_sa_OneTimeUse_s*)x->OneTimeUse->gg.g.n;
    return;
  case -1:
    y = (struct zx_sa_OneTimeUse_s*)x->OneTimeUse;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zx_sa_OneTimeUse_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->OneTimeUse; n > 1 && y->gg.g.n; --n, y = (struct zx_sa_OneTimeUse_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zx_sa_Conditions_NUM_ProxyRestriction) */

int zx_sa_Conditions_NUM_ProxyRestriction(struct zx_sa_Conditions_s* x)
{
  struct zx_sa_ProxyRestriction_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->ProxyRestriction; y; ++n, y = (struct zx_sa_ProxyRestriction_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zx_sa_Conditions_GET_ProxyRestriction) */

struct zx_sa_ProxyRestriction_s* zx_sa_Conditions_GET_ProxyRestriction(struct zx_sa_Conditions_s* x, int n)
{
  struct zx_sa_ProxyRestriction_s* y;
  if (!x) return 0;
  for (y = x->ProxyRestriction; n>=0 && y; --n, y = (struct zx_sa_ProxyRestriction_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zx_sa_Conditions_POP_ProxyRestriction) */

struct zx_sa_ProxyRestriction_s* zx_sa_Conditions_POP_ProxyRestriction(struct zx_sa_Conditions_s* x)
{
  struct zx_sa_ProxyRestriction_s* y;
  if (!x) return 0;
  y = x->ProxyRestriction;
  if (y)
    x->ProxyRestriction = (struct zx_sa_ProxyRestriction_s*)y->gg.g.n;
  return y;
}

/* FUNC(zx_sa_Conditions_PUSH_ProxyRestriction) */

void zx_sa_Conditions_PUSH_ProxyRestriction(struct zx_sa_Conditions_s* x, struct zx_sa_ProxyRestriction_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->ProxyRestriction->gg.g;
  x->ProxyRestriction = z;
}

/* FUNC(zx_sa_Conditions_REV_ProxyRestriction) */

void zx_sa_Conditions_REV_ProxyRestriction(struct zx_sa_Conditions_s* x)
{
  struct zx_sa_ProxyRestriction_s* nxt;
  struct zx_sa_ProxyRestriction_s* y;
  if (!x) return;
  y = x->ProxyRestriction;
  if (!y) return;
  x->ProxyRestriction = 0;
  while (y) {
    nxt = (struct zx_sa_ProxyRestriction_s*)y->gg.g.n;
    y->gg.g.n = &x->ProxyRestriction->gg.g;
    x->ProxyRestriction = y;
    y = nxt;
  }
}

/* FUNC(zx_sa_Conditions_PUT_ProxyRestriction) */

void zx_sa_Conditions_PUT_ProxyRestriction(struct zx_sa_Conditions_s* x, int n, struct zx_sa_ProxyRestriction_s* z)
{
  struct zx_sa_ProxyRestriction_s* y;
  if (!x || !z) return;
  y = x->ProxyRestriction;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->ProxyRestriction = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zx_sa_ProxyRestriction_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

