gitpan/zxid/c/saml2-getput.c
/* FUNC(zx_sa_SubjectConfirmation_DEL_SubjectConfirmationData) */

void zx_sa_SubjectConfirmation_DEL_SubjectConfirmationData(struct zx_sa_SubjectConfirmation_s* x, int n)
{
  struct zx_sa_SubjectConfirmationData_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->SubjectConfirmationData = (struct zx_sa_SubjectConfirmationData_s*)x->SubjectConfirmationData->gg.g.n;
    return;
  case -1:
    y = (struct zx_sa_SubjectConfirmationData_s*)x->SubjectConfirmationData;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zx_sa_SubjectConfirmationData_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->SubjectConfirmationData; n > 1 && y->gg.g.n; --n, y = (struct zx_sa_SubjectConfirmationData_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}

/* FUNC(zx_sa_SubjectConfirmation_GET_Method) */
struct zx_str_s* zx_sa_SubjectConfirmation_GET_Method(struct zx_sa_SubjectConfirmation_s* x) { return x->Method; }
/* FUNC(zx_sa_SubjectConfirmation_PUT_Method) */
void zx_sa_SubjectConfirmation_PUT_Method(struct zx_sa_SubjectConfirmation_s* x, struct zx_str_s* y) { x->Method = y; }





/* FUNC(zx_sa_SubjectConfirmationData_GET_NotBefore) */
struct zx_str_s* zx_sa_SubjectConfirmationData_GET_NotBefore(struct zx_sa_SubjectConfirmationData_s* x) { return x->NotBefore; }
/* FUNC(zx_sa_SubjectConfirmationData_PUT_NotBefore) */
void zx_sa_SubjectConfirmationData_PUT_NotBefore(struct zx_sa_SubjectConfirmationData_s* x, struct zx_str_s* y) { x->NotBefore = y; }
/* FUNC(zx_sa_SubjectConfirmationData_GET_NotOnOrAfter) */
struct zx_str_s* zx_sa_SubjectConfirmationData_GET_NotOnOrAfter(struct zx_sa_SubjectConfirmationData_s* x) { return x->NotOnOrAfter; }
/* FUNC(zx_sa_SubjectConfirmationData_PUT_NotOnOrAfter) */
void zx_sa_SubjectConfirmationData_PUT_NotOnOrAfter(struct zx_sa_SubjectConfirmationData_s* x, struct zx_str_s* y) { x->NotOnOrAfter = y; }
/* FUNC(zx_sa_SubjectConfirmationData_GET_Recipient) */
struct zx_str_s* zx_sa_SubjectConfirmationData_GET_Recipient(struct zx_sa_SubjectConfirmationData_s* x) { return x->Recipient; }
/* FUNC(zx_sa_SubjectConfirmationData_PUT_Recipient) */
void zx_sa_SubjectConfirmationData_PUT_Recipient(struct zx_sa_SubjectConfirmationData_s* x, struct zx_str_s* y) { x->Recipient = y; }
/* FUNC(zx_sa_SubjectConfirmationData_GET_InResponseTo) */
struct zx_str_s* zx_sa_SubjectConfirmationData_GET_InResponseTo(struct zx_sa_SubjectConfirmationData_s* x) { return x->InResponseTo; }
/* FUNC(zx_sa_SubjectConfirmationData_PUT_InResponseTo) */
void zx_sa_SubjectConfirmationData_PUT_InResponseTo(struct zx_sa_SubjectConfirmationData_s* x, struct zx_str_s* y) { x->InResponseTo = y; }
/* FUNC(zx_sa_SubjectConfirmationData_GET_Address) */
struct zx_str_s* zx_sa_SubjectConfirmationData_GET_Address(struct zx_sa_SubjectConfirmationData_s* x) { return x->Address; }
/* FUNC(zx_sa_SubjectConfirmationData_PUT_Address) */
void zx_sa_SubjectConfirmationData_PUT_Address(struct zx_sa_SubjectConfirmationData_s* x, struct zx_str_s* y) { x->Address = y; }





/* FUNC(zx_sa_SubjectLocality_GET_Address) */
struct zx_str_s* zx_sa_SubjectLocality_GET_Address(struct zx_sa_SubjectLocality_s* x) { return x->Address; }
/* FUNC(zx_sa_SubjectLocality_PUT_Address) */
void zx_sa_SubjectLocality_PUT_Address(struct zx_sa_SubjectLocality_s* x, struct zx_str_s* y) { x->Address = y; }
/* FUNC(zx_sa_SubjectLocality_GET_DNSName) */
struct zx_str_s* zx_sa_SubjectLocality_GET_DNSName(struct zx_sa_SubjectLocality_s* x) { return x->DNSName; }
/* FUNC(zx_sa_SubjectLocality_PUT_DNSName) */
void zx_sa_SubjectLocality_PUT_DNSName(struct zx_sa_SubjectLocality_s* x, struct zx_str_s* y) { x->DNSName = y; }







/* FUNC(zx_sa_TestElem_NUM_AttributeValue) */

int zx_sa_TestElem_NUM_AttributeValue(struct zx_sa_TestElem_s* x)
{
  struct zx_elem_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->AttributeValue; y; ++n, y = (struct zx_elem_s*)y->g.n) ;
  return n;
}

/* FUNC(zx_sa_TestElem_GET_AttributeValue) */

struct zx_elem_s* zx_sa_TestElem_GET_AttributeValue(struct zx_sa_TestElem_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  for (y = x->AttributeValue; n>=0 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
  return y;
}

/* FUNC(zx_sa_TestElem_POP_AttributeValue) */

struct zx_elem_s* zx_sa_TestElem_POP_AttributeValue(struct zx_sa_TestElem_s* x)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  y = x->AttributeValue;
  if (y)
    x->AttributeValue = (struct zx_elem_s*)y->g.n;
  return y;
}

/* FUNC(zx_sa_TestElem_PUSH_AttributeValue) */

void zx_sa_TestElem_PUSH_AttributeValue(struct zx_sa_TestElem_s* x, struct zx_elem_s* z)
{
  if (!x || !z) return;
  z->g.n = &x->AttributeValue->g;
  x->AttributeValue = z;
}

/* FUNC(zx_sa_TestElem_REV_AttributeValue) */

void zx_sa_TestElem_REV_AttributeValue(struct zx_sa_TestElem_s* x)
{
  struct zx_elem_s* nxt;
  struct zx_elem_s* y;
  if (!x) return;
  y = x->AttributeValue;
  if (!y) return;
  x->AttributeValue = 0;
  while (y) {
    nxt = (struct zx_elem_s*)y->g.n;
    y->g.n = &x->AttributeValue->g;
    x->AttributeValue = y;
    y = nxt;
  }
}

/* FUNC(zx_sa_TestElem_PUT_AttributeValue) */

void zx_sa_TestElem_PUT_AttributeValue(struct zx_sa_TestElem_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  y = x->AttributeValue;
  if (!y) return;
  switch (n) {
  case 0:
    z->g.n = y->g.n;
    x->AttributeValue = z;
    return;
  default:
    for (; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
    z->g.n = y->g.n->n;
    y->g.n = &z->g;
  }
}

/* FUNC(zx_sa_TestElem_ADD_AttributeValue) */

void zx_sa_TestElem_ADD_AttributeValue(struct zx_sa_TestElem_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->g.n = &x->AttributeValue->g;
    x->AttributeValue = z;
    return;
  case -1:
    y = x->AttributeValue;
    if (!y) goto add_to_start;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->AttributeValue; n > 1 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y) return;
  }
  z->g.n = y->g.n;
  y->g.n = &z->g;
}

/* FUNC(zx_sa_TestElem_DEL_AttributeValue) */

void zx_sa_TestElem_DEL_AttributeValue(struct zx_sa_TestElem_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->AttributeValue = (struct zx_elem_s*)x->AttributeValue->g.n;
    return;
  case -1:
    y = (struct zx_elem_s*)x->AttributeValue;
    if (!y) return;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->AttributeValue; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
  }
  y->g.n = y->g.n->n;
}








/* FUNC(zx_se_Body_NUM_ArtifactResolve) */

int zx_se_Body_NUM_ArtifactResolve(struct zx_se_Body_s* x)
{
  struct zx_sp_ArtifactResolve_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->ArtifactResolve; y; ++n, y = (struct zx_sp_ArtifactResolve_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zx_se_Body_GET_ArtifactResolve) */

struct zx_sp_ArtifactResolve_s* zx_se_Body_GET_ArtifactResolve(struct zx_se_Body_s* x, int n)
{
  struct zx_sp_ArtifactResolve_s* y;
  if (!x) return 0;
  for (y = x->ArtifactResolve; n>=0 && y; --n, y = (struct zx_sp_ArtifactResolve_s*)y->gg.g.n) ;
  return y;
}

