gitpan/zxid/c/saml2-getput.c
/* FUNC(zx_se_Body_PUSH_Fault) */

void zx_se_Body_PUSH_Fault(struct zx_se_Body_s* x, struct zx_se_Fault_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->Fault->gg.g;
  x->Fault = z;
}

/* FUNC(zx_se_Body_REV_Fault) */

void zx_se_Body_REV_Fault(struct zx_se_Body_s* x)
{
  struct zx_se_Fault_s* nxt;
  struct zx_se_Fault_s* y;
  if (!x) return;
  y = x->Fault;
  if (!y) return;
  x->Fault = 0;
  while (y) {
    nxt = (struct zx_se_Fault_s*)y->gg.g.n;
    y->gg.g.n = &x->Fault->gg.g;
    x->Fault = y;
    y = nxt;
  }
}

/* FUNC(zx_se_Body_PUT_Fault) */

void zx_se_Body_PUT_Fault(struct zx_se_Body_s* x, int n, struct zx_se_Fault_s* z)
{
  struct zx_se_Fault_s* y;
  if (!x || !z) return;
  y = x->Fault;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->Fault = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zx_se_Fault_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zx_se_Body_ADD_Fault) */

void zx_se_Body_ADD_Fault(struct zx_se_Body_s* x, int n, struct zx_se_Fault_s* z)
{
  struct zx_se_Fault_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->Fault->gg.g;
    x->Fault = z;
    return;
  case -1:
    y = x->Fault;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zx_se_Fault_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->Fault; n > 1 && y; --n, y = (struct zx_se_Fault_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zx_se_Body_DEL_Fault) */

void zx_se_Body_DEL_Fault(struct zx_se_Body_s* x, int n)
{
  struct zx_se_Fault_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->Fault = (struct zx_se_Fault_s*)x->Fault->gg.g.n;
    return;
  case -1:
    y = (struct zx_se_Fault_s*)x->Fault;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zx_se_Fault_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->Fault; n > 1 && y->gg.g.n; --n, y = (struct zx_se_Fault_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}








/* FUNC(zx_se_Envelope_NUM_Header) */

int zx_se_Envelope_NUM_Header(struct zx_se_Envelope_s* x)
{
  struct zx_se_Header_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->Header; y; ++n, y = (struct zx_se_Header_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zx_se_Envelope_GET_Header) */

struct zx_se_Header_s* zx_se_Envelope_GET_Header(struct zx_se_Envelope_s* x, int n)
{
  struct zx_se_Header_s* y;
  if (!x) return 0;
  for (y = x->Header; n>=0 && y; --n, y = (struct zx_se_Header_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zx_se_Envelope_POP_Header) */

struct zx_se_Header_s* zx_se_Envelope_POP_Header(struct zx_se_Envelope_s* x)
{
  struct zx_se_Header_s* y;
  if (!x) return 0;
  y = x->Header;
  if (y)
    x->Header = (struct zx_se_Header_s*)y->gg.g.n;
  return y;
}

/* FUNC(zx_se_Envelope_PUSH_Header) */

void zx_se_Envelope_PUSH_Header(struct zx_se_Envelope_s* x, struct zx_se_Header_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->Header->gg.g;
  x->Header = z;
}

/* FUNC(zx_se_Envelope_REV_Header) */

void zx_se_Envelope_REV_Header(struct zx_se_Envelope_s* x)
{
  struct zx_se_Header_s* nxt;
  struct zx_se_Header_s* y;
  if (!x) return;
  y = x->Header;
  if (!y) return;
  x->Header = 0;
  while (y) {
    nxt = (struct zx_se_Header_s*)y->gg.g.n;
    y->gg.g.n = &x->Header->gg.g;
    x->Header = y;
    y = nxt;
  }
}

/* FUNC(zx_se_Envelope_PUT_Header) */

void zx_se_Envelope_PUT_Header(struct zx_se_Envelope_s* x, int n, struct zx_se_Header_s* z)
{
  struct zx_se_Header_s* y;
  if (!x || !z) return;
  y = x->Header;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->Header = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zx_se_Header_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zx_se_Envelope_ADD_Header) */

void zx_se_Envelope_ADD_Header(struct zx_se_Envelope_s* x, int n, struct zx_se_Header_s* z)
{
  struct zx_se_Header_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->Header->gg.g;
    x->Header = z;
    return;
  case -1:
    y = x->Header;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zx_se_Header_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->Header; n > 1 && y; --n, y = (struct zx_se_Header_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zx_se_Envelope_DEL_Header) */

void zx_se_Envelope_DEL_Header(struct zx_se_Envelope_s* x, int n)
{
  struct zx_se_Header_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->Header = (struct zx_se_Header_s*)x->Header->gg.g.n;
    return;
  case -1:
    y = (struct zx_se_Header_s*)x->Header;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zx_se_Header_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->Header; n > 1 && y->gg.g.n; --n, y = (struct zx_se_Header_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zx_se_Envelope_NUM_Body) */

int zx_se_Envelope_NUM_Body(struct zx_se_Envelope_s* x)
{
  struct zx_se_Body_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->Body; y; ++n, y = (struct zx_se_Body_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zx_se_Envelope_GET_Body) */

struct zx_se_Body_s* zx_se_Envelope_GET_Body(struct zx_se_Envelope_s* x, int n)
{
  struct zx_se_Body_s* y;
  if (!x) return 0;
  for (y = x->Body; n>=0 && y; --n, y = (struct zx_se_Body_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zx_se_Envelope_POP_Body) */

struct zx_se_Body_s* zx_se_Envelope_POP_Body(struct zx_se_Envelope_s* x)
{
  struct zx_se_Body_s* y;
  if (!x) return 0;
  y = x->Body;
  if (y)
    x->Body = (struct zx_se_Body_s*)y->gg.g.n;
  return y;
}

/* FUNC(zx_se_Envelope_PUSH_Body) */

void zx_se_Envelope_PUSH_Body(struct zx_se_Envelope_s* x, struct zx_se_Body_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->Body->gg.g;
  x->Body = z;
}

/* FUNC(zx_se_Envelope_REV_Body) */

