gitpan/zxid/c/saml2-getput.c
int zx_sp_ManageNameIDRequest_NUM_NewEncryptedID(struct zx_sp_ManageNameIDRequest_s* x)
{
  struct zx_sp_NewEncryptedID_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->NewEncryptedID; y; ++n, y = (struct zx_sp_NewEncryptedID_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zx_sp_ManageNameIDRequest_GET_NewEncryptedID) */

struct zx_sp_NewEncryptedID_s* zx_sp_ManageNameIDRequest_GET_NewEncryptedID(struct zx_sp_ManageNameIDRequest_s* x, int n)
{
  struct zx_sp_NewEncryptedID_s* y;
  if (!x) return 0;
  for (y = x->NewEncryptedID; n>=0 && y; --n, y = (struct zx_sp_NewEncryptedID_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zx_sp_ManageNameIDRequest_POP_NewEncryptedID) */

struct zx_sp_NewEncryptedID_s* zx_sp_ManageNameIDRequest_POP_NewEncryptedID(struct zx_sp_ManageNameIDRequest_s* x)
{
  struct zx_sp_NewEncryptedID_s* y;
  if (!x) return 0;
  y = x->NewEncryptedID;
  if (y)
    x->NewEncryptedID = (struct zx_sp_NewEncryptedID_s*)y->gg.g.n;
  return y;
}

/* FUNC(zx_sp_ManageNameIDRequest_PUSH_NewEncryptedID) */

void zx_sp_ManageNameIDRequest_PUSH_NewEncryptedID(struct zx_sp_ManageNameIDRequest_s* x, struct zx_sp_NewEncryptedID_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->NewEncryptedID->gg.g;
  x->NewEncryptedID = z;
}

/* FUNC(zx_sp_ManageNameIDRequest_REV_NewEncryptedID) */

void zx_sp_ManageNameIDRequest_REV_NewEncryptedID(struct zx_sp_ManageNameIDRequest_s* x)
{
  struct zx_sp_NewEncryptedID_s* nxt;
  struct zx_sp_NewEncryptedID_s* y;
  if (!x) return;
  y = x->NewEncryptedID;
  if (!y) return;
  x->NewEncryptedID = 0;
  while (y) {
    nxt = (struct zx_sp_NewEncryptedID_s*)y->gg.g.n;
    y->gg.g.n = &x->NewEncryptedID->gg.g;
    x->NewEncryptedID = y;
    y = nxt;
  }
}

/* FUNC(zx_sp_ManageNameIDRequest_PUT_NewEncryptedID) */

void zx_sp_ManageNameIDRequest_PUT_NewEncryptedID(struct zx_sp_ManageNameIDRequest_s* x, int n, struct zx_sp_NewEncryptedID_s* z)
{
  struct zx_sp_NewEncryptedID_s* y;
  if (!x || !z) return;
  y = x->NewEncryptedID;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->NewEncryptedID = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zx_sp_NewEncryptedID_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zx_sp_ManageNameIDRequest_ADD_NewEncryptedID) */

void zx_sp_ManageNameIDRequest_ADD_NewEncryptedID(struct zx_sp_ManageNameIDRequest_s* x, int n, struct zx_sp_NewEncryptedID_s* z)
{
  struct zx_sp_NewEncryptedID_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->NewEncryptedID->gg.g;
    x->NewEncryptedID = z;
    return;
  case -1:
    y = x->NewEncryptedID;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zx_sp_NewEncryptedID_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->NewEncryptedID; n > 1 && y; --n, y = (struct zx_sp_NewEncryptedID_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zx_sp_ManageNameIDRequest_DEL_NewEncryptedID) */

void zx_sp_ManageNameIDRequest_DEL_NewEncryptedID(struct zx_sp_ManageNameIDRequest_s* x, int n)
{
  struct zx_sp_NewEncryptedID_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->NewEncryptedID = (struct zx_sp_NewEncryptedID_s*)x->NewEncryptedID->gg.g.n;
    return;
  case -1:
    y = (struct zx_sp_NewEncryptedID_s*)x->NewEncryptedID;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zx_sp_NewEncryptedID_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->NewEncryptedID; n > 1 && y->gg.g.n; --n, y = (struct zx_sp_NewEncryptedID_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zx_sp_ManageNameIDRequest_NUM_Terminate) */

int zx_sp_ManageNameIDRequest_NUM_Terminate(struct zx_sp_ManageNameIDRequest_s* x)
{
  struct zx_elem_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->Terminate; y; ++n, y = (struct zx_elem_s*)y->g.n) ;
  return n;
}

/* FUNC(zx_sp_ManageNameIDRequest_GET_Terminate) */

struct zx_elem_s* zx_sp_ManageNameIDRequest_GET_Terminate(struct zx_sp_ManageNameIDRequest_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  for (y = x->Terminate; n>=0 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
  return y;
}

/* FUNC(zx_sp_ManageNameIDRequest_POP_Terminate) */

struct zx_elem_s* zx_sp_ManageNameIDRequest_POP_Terminate(struct zx_sp_ManageNameIDRequest_s* x)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  y = x->Terminate;
  if (y)
    x->Terminate = (struct zx_elem_s*)y->g.n;
  return y;
}

/* FUNC(zx_sp_ManageNameIDRequest_PUSH_Terminate) */

void zx_sp_ManageNameIDRequest_PUSH_Terminate(struct zx_sp_ManageNameIDRequest_s* x, struct zx_elem_s* z)
{
  if (!x || !z) return;
  z->g.n = &x->Terminate->g;
  x->Terminate = z;
}

/* FUNC(zx_sp_ManageNameIDRequest_REV_Terminate) */

void zx_sp_ManageNameIDRequest_REV_Terminate(struct zx_sp_ManageNameIDRequest_s* x)
{
  struct zx_elem_s* nxt;
  struct zx_elem_s* y;
  if (!x) return;
  y = x->Terminate;
  if (!y) return;
  x->Terminate = 0;
  while (y) {
    nxt = (struct zx_elem_s*)y->g.n;
    y->g.n = &x->Terminate->g;
    x->Terminate = y;
    y = nxt;
  }
}

/* FUNC(zx_sp_ManageNameIDRequest_PUT_Terminate) */

void zx_sp_ManageNameIDRequest_PUT_Terminate(struct zx_sp_ManageNameIDRequest_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  y = x->Terminate;
  if (!y) return;
  switch (n) {
  case 0:
    z->g.n = y->g.n;
    x->Terminate = z;
    return;
  default:
    for (; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
    z->g.n = y->g.n->n;
    y->g.n = &z->g;
  }
}

/* FUNC(zx_sp_ManageNameIDRequest_ADD_Terminate) */

void zx_sp_ManageNameIDRequest_ADD_Terminate(struct zx_sp_ManageNameIDRequest_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->g.n = &x->Terminate->g;
    x->Terminate = z;
    return;
  case -1:
    y = x->Terminate;
    if (!y) goto add_to_start;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->Terminate; n > 1 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y) return;
  }
  z->g.n = y->g.n;
  y->g.n = &z->g;
}

/* FUNC(zx_sp_ManageNameIDRequest_DEL_Terminate) */

