gitpan/zxid/c/saml2-getput.c
struct zx_elem_s* zx_xenc_CipherData_POP_CipherValue(struct zx_xenc_CipherData_s* x)
{
  struct zx_elem_s* y;
  if (!x) return 0;
  y = x->CipherValue;
  if (y)
    x->CipherValue = (struct zx_elem_s*)y->g.n;
  return y;
}

/* FUNC(zx_xenc_CipherData_PUSH_CipherValue) */

void zx_xenc_CipherData_PUSH_CipherValue(struct zx_xenc_CipherData_s* x, struct zx_elem_s* z)
{
  if (!x || !z) return;
  z->g.n = &x->CipherValue->g;
  x->CipherValue = z;
}

/* FUNC(zx_xenc_CipherData_REV_CipherValue) */

void zx_xenc_CipherData_REV_CipherValue(struct zx_xenc_CipherData_s* x)
{
  struct zx_elem_s* nxt;
  struct zx_elem_s* y;
  if (!x) return;
  y = x->CipherValue;
  if (!y) return;
  x->CipherValue = 0;
  while (y) {
    nxt = (struct zx_elem_s*)y->g.n;
    y->g.n = &x->CipherValue->g;
    x->CipherValue = y;
    y = nxt;
  }
}

/* FUNC(zx_xenc_CipherData_PUT_CipherValue) */

void zx_xenc_CipherData_PUT_CipherValue(struct zx_xenc_CipherData_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  y = x->CipherValue;
  if (!y) return;
  switch (n) {
  case 0:
    z->g.n = y->g.n;
    x->CipherValue = z;
    return;
  default:
    for (; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
    z->g.n = y->g.n->n;
    y->g.n = &z->g;
  }
}

/* FUNC(zx_xenc_CipherData_ADD_CipherValue) */

void zx_xenc_CipherData_ADD_CipherValue(struct zx_xenc_CipherData_s* x, int n, struct zx_elem_s* z)
{
  struct zx_elem_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->g.n = &x->CipherValue->g;
    x->CipherValue = z;
    return;
  case -1:
    y = x->CipherValue;
    if (!y) goto add_to_start;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->CipherValue; n > 1 && y; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y) return;
  }
  z->g.n = y->g.n;
  y->g.n = &z->g;
}

/* FUNC(zx_xenc_CipherData_DEL_CipherValue) */

void zx_xenc_CipherData_DEL_CipherValue(struct zx_xenc_CipherData_s* x, int n)
{
  struct zx_elem_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->CipherValue = (struct zx_elem_s*)x->CipherValue->g.n;
    return;
  case -1:
    y = (struct zx_elem_s*)x->CipherValue;
    if (!y) return;
    for (; y->g.n; y = (struct zx_elem_s*)y->g.n) ;
    break;
  default:
    for (y = x->CipherValue; n > 1 && y->g.n; --n, y = (struct zx_elem_s*)y->g.n) ;
    if (!y->g.n) return;
  }
  y->g.n = y->g.n->n;
}



/* FUNC(zx_xenc_CipherData_NUM_CipherReference) */

int zx_xenc_CipherData_NUM_CipherReference(struct zx_xenc_CipherData_s* x)
{
  struct zx_xenc_CipherReference_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->CipherReference; y; ++n, y = (struct zx_xenc_CipherReference_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zx_xenc_CipherData_GET_CipherReference) */

struct zx_xenc_CipherReference_s* zx_xenc_CipherData_GET_CipherReference(struct zx_xenc_CipherData_s* x, int n)
{
  struct zx_xenc_CipherReference_s* y;
  if (!x) return 0;
  for (y = x->CipherReference; n>=0 && y; --n, y = (struct zx_xenc_CipherReference_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zx_xenc_CipherData_POP_CipherReference) */

struct zx_xenc_CipherReference_s* zx_xenc_CipherData_POP_CipherReference(struct zx_xenc_CipherData_s* x)
{
  struct zx_xenc_CipherReference_s* y;
  if (!x) return 0;
  y = x->CipherReference;
  if (y)
    x->CipherReference = (struct zx_xenc_CipherReference_s*)y->gg.g.n;
  return y;
}

/* FUNC(zx_xenc_CipherData_PUSH_CipherReference) */

void zx_xenc_CipherData_PUSH_CipherReference(struct zx_xenc_CipherData_s* x, struct zx_xenc_CipherReference_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->CipherReference->gg.g;
  x->CipherReference = z;
}

/* FUNC(zx_xenc_CipherData_REV_CipherReference) */

void zx_xenc_CipherData_REV_CipherReference(struct zx_xenc_CipherData_s* x)
{
  struct zx_xenc_CipherReference_s* nxt;
  struct zx_xenc_CipherReference_s* y;
  if (!x) return;
  y = x->CipherReference;
  if (!y) return;
  x->CipherReference = 0;
  while (y) {
    nxt = (struct zx_xenc_CipherReference_s*)y->gg.g.n;
    y->gg.g.n = &x->CipherReference->gg.g;
    x->CipherReference = y;
    y = nxt;
  }
}

/* FUNC(zx_xenc_CipherData_PUT_CipherReference) */

void zx_xenc_CipherData_PUT_CipherReference(struct zx_xenc_CipherData_s* x, int n, struct zx_xenc_CipherReference_s* z)
{
  struct zx_xenc_CipherReference_s* y;
  if (!x || !z) return;
  y = x->CipherReference;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->CipherReference = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zx_xenc_CipherReference_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zx_xenc_CipherData_ADD_CipherReference) */

void zx_xenc_CipherData_ADD_CipherReference(struct zx_xenc_CipherData_s* x, int n, struct zx_xenc_CipherReference_s* z)
{
  struct zx_xenc_CipherReference_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->CipherReference->gg.g;
    x->CipherReference = z;
    return;
  case -1:
    y = x->CipherReference;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zx_xenc_CipherReference_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->CipherReference; n > 1 && y; --n, y = (struct zx_xenc_CipherReference_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zx_xenc_CipherData_DEL_CipherReference) */

void zx_xenc_CipherData_DEL_CipherReference(struct zx_xenc_CipherData_s* x, int n)
{
  struct zx_xenc_CipherReference_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->CipherReference = (struct zx_xenc_CipherReference_s*)x->CipherReference->gg.g.n;
    return;
  case -1:
    y = (struct zx_xenc_CipherReference_s*)x->CipherReference;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zx_xenc_CipherReference_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->CipherReference; n > 1 && y->gg.g.n; --n, y = (struct zx_xenc_CipherReference_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}








