gitpan/zxid/c/saml2-getput.c
/* FUNC(zx_xenc_EncryptedKey_DEL_KeyInfo) */

void zx_xenc_EncryptedKey_DEL_KeyInfo(struct zx_xenc_EncryptedKey_s* x, int n)
{
  struct zx_ds_KeyInfo_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->KeyInfo = (struct zx_ds_KeyInfo_s*)x->KeyInfo->gg.g.n;
    return;
  case -1:
    y = (struct zx_ds_KeyInfo_s*)x->KeyInfo;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zx_ds_KeyInfo_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->KeyInfo; n > 1 && y->gg.g.n; --n, y = (struct zx_ds_KeyInfo_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zx_xenc_EncryptedKey_NUM_CipherData) */

int zx_xenc_EncryptedKey_NUM_CipherData(struct zx_xenc_EncryptedKey_s* x)
{
  struct zx_xenc_CipherData_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->CipherData; y; ++n, y = (struct zx_xenc_CipherData_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zx_xenc_EncryptedKey_GET_CipherData) */

struct zx_xenc_CipherData_s* zx_xenc_EncryptedKey_GET_CipherData(struct zx_xenc_EncryptedKey_s* x, int n)
{
  struct zx_xenc_CipherData_s* y;
  if (!x) return 0;
  for (y = x->CipherData; n>=0 && y; --n, y = (struct zx_xenc_CipherData_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zx_xenc_EncryptedKey_POP_CipherData) */

struct zx_xenc_CipherData_s* zx_xenc_EncryptedKey_POP_CipherData(struct zx_xenc_EncryptedKey_s* x)
{
  struct zx_xenc_CipherData_s* y;
  if (!x) return 0;
  y = x->CipherData;
  if (y)
    x->CipherData = (struct zx_xenc_CipherData_s*)y->gg.g.n;
  return y;
}

/* FUNC(zx_xenc_EncryptedKey_PUSH_CipherData) */

void zx_xenc_EncryptedKey_PUSH_CipherData(struct zx_xenc_EncryptedKey_s* x, struct zx_xenc_CipherData_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->CipherData->gg.g;
  x->CipherData = z;
}

/* FUNC(zx_xenc_EncryptedKey_REV_CipherData) */

void zx_xenc_EncryptedKey_REV_CipherData(struct zx_xenc_EncryptedKey_s* x)
{
  struct zx_xenc_CipherData_s* nxt;
  struct zx_xenc_CipherData_s* y;
  if (!x) return;
  y = x->CipherData;
  if (!y) return;
  x->CipherData = 0;
  while (y) {
    nxt = (struct zx_xenc_CipherData_s*)y->gg.g.n;
    y->gg.g.n = &x->CipherData->gg.g;
    x->CipherData = y;
    y = nxt;
  }
}

/* FUNC(zx_xenc_EncryptedKey_PUT_CipherData) */

void zx_xenc_EncryptedKey_PUT_CipherData(struct zx_xenc_EncryptedKey_s* x, int n, struct zx_xenc_CipherData_s* z)
{
  struct zx_xenc_CipherData_s* y;
  if (!x || !z) return;
  y = x->CipherData;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->CipherData = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zx_xenc_CipherData_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zx_xenc_EncryptedKey_ADD_CipherData) */

void zx_xenc_EncryptedKey_ADD_CipherData(struct zx_xenc_EncryptedKey_s* x, int n, struct zx_xenc_CipherData_s* z)
{
  struct zx_xenc_CipherData_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->CipherData->gg.g;
    x->CipherData = z;
    return;
  case -1:
    y = x->CipherData;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zx_xenc_CipherData_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->CipherData; n > 1 && y; --n, y = (struct zx_xenc_CipherData_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zx_xenc_EncryptedKey_DEL_CipherData) */

void zx_xenc_EncryptedKey_DEL_CipherData(struct zx_xenc_EncryptedKey_s* x, int n)
{
  struct zx_xenc_CipherData_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->CipherData = (struct zx_xenc_CipherData_s*)x->CipherData->gg.g.n;
    return;
  case -1:
    y = (struct zx_xenc_CipherData_s*)x->CipherData;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zx_xenc_CipherData_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->CipherData; n > 1 && y->gg.g.n; --n, y = (struct zx_xenc_CipherData_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zx_xenc_EncryptedKey_NUM_EncryptionProperties) */

int zx_xenc_EncryptedKey_NUM_EncryptionProperties(struct zx_xenc_EncryptedKey_s* x)
{
  struct zx_xenc_EncryptionProperties_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->EncryptionProperties; y; ++n, y = (struct zx_xenc_EncryptionProperties_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zx_xenc_EncryptedKey_GET_EncryptionProperties) */

struct zx_xenc_EncryptionProperties_s* zx_xenc_EncryptedKey_GET_EncryptionProperties(struct zx_xenc_EncryptedKey_s* x, int n)
{
  struct zx_xenc_EncryptionProperties_s* y;
  if (!x) return 0;
  for (y = x->EncryptionProperties; n>=0 && y; --n, y = (struct zx_xenc_EncryptionProperties_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zx_xenc_EncryptedKey_POP_EncryptionProperties) */

struct zx_xenc_EncryptionProperties_s* zx_xenc_EncryptedKey_POP_EncryptionProperties(struct zx_xenc_EncryptedKey_s* x)
{
  struct zx_xenc_EncryptionProperties_s* y;
  if (!x) return 0;
  y = x->EncryptionProperties;
  if (y)
    x->EncryptionProperties = (struct zx_xenc_EncryptionProperties_s*)y->gg.g.n;
  return y;
}

/* FUNC(zx_xenc_EncryptedKey_PUSH_EncryptionProperties) */

void zx_xenc_EncryptedKey_PUSH_EncryptionProperties(struct zx_xenc_EncryptedKey_s* x, struct zx_xenc_EncryptionProperties_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->EncryptionProperties->gg.g;
  x->EncryptionProperties = z;
}

/* FUNC(zx_xenc_EncryptedKey_REV_EncryptionProperties) */

void zx_xenc_EncryptedKey_REV_EncryptionProperties(struct zx_xenc_EncryptedKey_s* x)
{
  struct zx_xenc_EncryptionProperties_s* nxt;
  struct zx_xenc_EncryptionProperties_s* y;
  if (!x) return;
  y = x->EncryptionProperties;
  if (!y) return;
  x->EncryptionProperties = 0;
  while (y) {
    nxt = (struct zx_xenc_EncryptionProperties_s*)y->gg.g.n;
    y->gg.g.n = &x->EncryptionProperties->gg.g;
    x->EncryptionProperties = y;
    y = nxt;
  }
}

/* FUNC(zx_xenc_EncryptedKey_PUT_EncryptionProperties) */

void zx_xenc_EncryptedKey_PUT_EncryptionProperties(struct zx_xenc_EncryptedKey_s* x, int n, struct zx_xenc_EncryptionProperties_s* z)
{
  struct zx_xenc_EncryptionProperties_s* y;
  if (!x || !z) return;
  y = x->EncryptionProperties;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->EncryptionProperties = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zx_xenc_EncryptionProperties_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zx_xenc_EncryptedKey_ADD_EncryptionProperties) */

