gitpan/zxid/c/saml2-getput.c
struct zx_sp_ManageNameIDResponse_s* zx_root_POP_ManageNameIDResponse(struct zx_root_s* x)
{
  struct zx_sp_ManageNameIDResponse_s* y;
  if (!x) return 0;
  y = x->ManageNameIDResponse;
  if (y)
    x->ManageNameIDResponse = (struct zx_sp_ManageNameIDResponse_s*)y->gg.g.n;
  return y;
}

/* FUNC(zx_root_PUSH_ManageNameIDResponse) */

void zx_root_PUSH_ManageNameIDResponse(struct zx_root_s* x, struct zx_sp_ManageNameIDResponse_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->ManageNameIDResponse->gg.g;
  x->ManageNameIDResponse = z;
}

/* FUNC(zx_root_REV_ManageNameIDResponse) */

void zx_root_REV_ManageNameIDResponse(struct zx_root_s* x)
{
  struct zx_sp_ManageNameIDResponse_s* nxt;
  struct zx_sp_ManageNameIDResponse_s* y;
  if (!x) return;
  y = x->ManageNameIDResponse;
  if (!y) return;
  x->ManageNameIDResponse = 0;
  while (y) {
    nxt = (struct zx_sp_ManageNameIDResponse_s*)y->gg.g.n;
    y->gg.g.n = &x->ManageNameIDResponse->gg.g;
    x->ManageNameIDResponse = y;
    y = nxt;
  }
}

/* FUNC(zx_root_PUT_ManageNameIDResponse) */

void zx_root_PUT_ManageNameIDResponse(struct zx_root_s* x, int n, struct zx_sp_ManageNameIDResponse_s* z)
{
  struct zx_sp_ManageNameIDResponse_s* y;
  if (!x || !z) return;
  y = x->ManageNameIDResponse;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->ManageNameIDResponse = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zx_sp_ManageNameIDResponse_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zx_root_ADD_ManageNameIDResponse) */

void zx_root_ADD_ManageNameIDResponse(struct zx_root_s* x, int n, struct zx_sp_ManageNameIDResponse_s* z)
{
  struct zx_sp_ManageNameIDResponse_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->ManageNameIDResponse->gg.g;
    x->ManageNameIDResponse = z;
    return;
  case -1:
    y = x->ManageNameIDResponse;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zx_sp_ManageNameIDResponse_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->ManageNameIDResponse; n > 1 && y; --n, y = (struct zx_sp_ManageNameIDResponse_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zx_root_DEL_ManageNameIDResponse) */

void zx_root_DEL_ManageNameIDResponse(struct zx_root_s* x, int n)
{
  struct zx_sp_ManageNameIDResponse_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->ManageNameIDResponse = (struct zx_sp_ManageNameIDResponse_s*)x->ManageNameIDResponse->gg.g.n;
    return;
  case -1:
    y = (struct zx_sp_ManageNameIDResponse_s*)x->ManageNameIDResponse;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zx_sp_ManageNameIDResponse_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->ManageNameIDResponse; n > 1 && y->gg.g.n; --n, y = (struct zx_sp_ManageNameIDResponse_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}



/* FUNC(zx_root_NUM_Envelope) */

int zx_root_NUM_Envelope(struct zx_root_s* x)
{
  struct zx_se_Envelope_s* y;
  int n = 0;
  if (!x) return 0;
  for (y = x->Envelope; y; ++n, y = (struct zx_se_Envelope_s*)y->gg.g.n) ;
  return n;
}

/* FUNC(zx_root_GET_Envelope) */

struct zx_se_Envelope_s* zx_root_GET_Envelope(struct zx_root_s* x, int n)
{
  struct zx_se_Envelope_s* y;
  if (!x) return 0;
  for (y = x->Envelope; n>=0 && y; --n, y = (struct zx_se_Envelope_s*)y->gg.g.n) ;
  return y;
}

/* FUNC(zx_root_POP_Envelope) */

struct zx_se_Envelope_s* zx_root_POP_Envelope(struct zx_root_s* x)
{
  struct zx_se_Envelope_s* y;
  if (!x) return 0;
  y = x->Envelope;
  if (y)
    x->Envelope = (struct zx_se_Envelope_s*)y->gg.g.n;
  return y;
}

/* FUNC(zx_root_PUSH_Envelope) */

void zx_root_PUSH_Envelope(struct zx_root_s* x, struct zx_se_Envelope_s* z)
{
  if (!x || !z) return;
  z->gg.g.n = &x->Envelope->gg.g;
  x->Envelope = z;
}

/* FUNC(zx_root_REV_Envelope) */

void zx_root_REV_Envelope(struct zx_root_s* x)
{
  struct zx_se_Envelope_s* nxt;
  struct zx_se_Envelope_s* y;
  if (!x) return;
  y = x->Envelope;
  if (!y) return;
  x->Envelope = 0;
  while (y) {
    nxt = (struct zx_se_Envelope_s*)y->gg.g.n;
    y->gg.g.n = &x->Envelope->gg.g;
    x->Envelope = y;
    y = nxt;
  }
}

/* FUNC(zx_root_PUT_Envelope) */

void zx_root_PUT_Envelope(struct zx_root_s* x, int n, struct zx_se_Envelope_s* z)
{
  struct zx_se_Envelope_s* y;
  if (!x || !z) return;
  y = x->Envelope;
  if (!y) return;
  switch (n) {
  case 0:
    z->gg.g.n = y->gg.g.n;
    x->Envelope = z;
    return;
  default:
    for (; n > 1 && y->gg.g.n; --n, y = (struct zx_se_Envelope_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
    z->gg.g.n = y->gg.g.n->n;
    y->gg.g.n = &z->gg.g;
  }
}

/* FUNC(zx_root_ADD_Envelope) */

void zx_root_ADD_Envelope(struct zx_root_s* x, int n, struct zx_se_Envelope_s* z)
{
  struct zx_se_Envelope_s* y;
  if (!x || !z) return;
  switch (n) {
  case 0:
  add_to_start:
    z->gg.g.n = &x->Envelope->gg.g;
    x->Envelope = z;
    return;
  case -1:
    y = x->Envelope;
    if (!y) goto add_to_start;
    for (; y->gg.g.n; y = (struct zx_se_Envelope_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->Envelope; n > 1 && y; --n, y = (struct zx_se_Envelope_s*)y->gg.g.n) ;
    if (!y) return;
  }
  z->gg.g.n = y->gg.g.n;
  y->gg.g.n = &z->gg.g;
}

/* FUNC(zx_root_DEL_Envelope) */

void zx_root_DEL_Envelope(struct zx_root_s* x, int n)
{
  struct zx_se_Envelope_s* y;
  if (!x) return;
  switch (n) {
  case 0:
    x->Envelope = (struct zx_se_Envelope_s*)x->Envelope->gg.g.n;
    return;
  case -1:
    y = (struct zx_se_Envelope_s*)x->Envelope;
    if (!y) return;
    for (; y->gg.g.n; y = (struct zx_se_Envelope_s*)y->gg.g.n) ;
    break;
  default:
    for (y = x->Envelope; n > 1 && y->gg.g.n; --n, y = (struct zx_se_Envelope_s*)y->gg.g.n) ;
    if (!y->gg.g.n) return;
  }
  y->gg.g.n = y->gg.g.n->n;
}











